app/controllers/boos_controller.rb

SELECT "boos".* FROM "boos"
---
  def index
    @boos = Boo.all