app/controllers/comensales_controller.rb

SELECT "comensales".* FROM "comensales"
---
  def index
    @comensales = Comensale.all

INSERT INTO "comensales" ("nombre", "codigo", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["nombre", "Rilmar Jose Perez"], ["codigo", 6405351], ["created_at", "2017-06-16 19:04:17.395803"], ["updated_at", "2017-06-16 19:04:17.395803"]]
---
  def create
    @comensale = Comensale.new(comensale_params)

    respond_to do |format|
      if @comensale.save

SELECT  "comensales".* FROM "comensales" WHERE "comensales"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_comensale
      @comensale = Comensale.find(params[:id])