app/controllers/turnos_controller.rb

  def index
    @turnos = Turno.all
---
SELECT "turnos".* FROM "turnos"

  def create
    @turno = Turno.new(turno_params)

    respond_to do |format|
      if @turno.save
---
INSERT INTO "turnos" ("codigoturno", "horas", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["codigoturno", 800], ["horas", 8], ["created_at", "2017-06-16 17:47:04.393800"], ["updated_at", "2017-06-16 17:47:04.393800"]]

    def set_turno
      @turno = Turno.find(params[:id])
---
SELECT  "turnos".* FROM "turnos" WHERE "turnos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]